label blue_scene_1:
    "И вот, спустя день трудностей и написания костылей, ты наконец подготовил всё нужное для создания прототипа платформера на UnrealEngine."
    "И ты чувствуешь..."
    "..."
    play music I_WANT_PANDEMONIKA
    show gg angry_
    "{cps=100}{sc=10}{b=40}{color=#ff0000}ЯРОСТЬ{/color}{/b}{/sc}{/cps}"

    maincharacter "{cps=50}{sc=10}{b=40}{color=#ff0000}БОЖЕ{/color}{/b}{/sc}{/cps}"
    maincharacter "{cps=50}{sc=10}{b=40}{color=#ff0000}МОЙ{/color}{/b}{/sc}{/cps}"
    maincharacter "{cps=50}{color=#ff0000}ПОЧЕМУ ТУТ ВСЁ ТАК СЛОЖНО?{/color}{/cps}"
    maincharacter "{cps=50}РАЗРАБОТКА ЕЩЁ НЕ НАЧАЛАСЬ, А У МЕНЯ УЖЕ КУЧА КОСТЫЛЕЙ В ПРОЕКТЕ.{/cps}"
    maincharacter "{cps=20}Чтобы понять, как нормально сделать этот чёртов {bt=6}{color=#1cd3a2}Tilemap{/color}{/bt} мне понадобилось {sc=10}{color=#ff0000}несколько часов{/color}{/sc}!{/cps}"
    maincharacter "{cps=20}Такое чувство, что движок создавался не совсем для 2D игр.{/cps}"
    stop music fadeout 5
    maincharacter "Стоп."
    maincharacter "Возможно, так и есть..."
    maincharacter "Но не время унывать! У меня есть ещё время в запасе, я справлюсь!"
    jump big_scene_2

label blue_scene_2:
    maincharacter "Без паники! у меня уже почти всё готово!"
    maincharacter "Нужно лишь реализовать пару простых механик, сделать уровни и украсть... "
    maincharacter "ой, то есть одолжить спрайты из интернета! Не будет мне никакого отдыха в эти 2 дня! За работу!!"

    "Ты начинаешь работать в усиленном темпе. Ты реализуешь двойной прыжок и стрельбу из оружия."
    "Получается, конечно, не без багов, но сейчас нет времени их исправлять."
    "Ты в спешке берёшь первый понравившийся тебе сет спрайтов из интернета, без раздумья скачивая и подключая его к своей игре через Tilemap. Далее ты заимствуешь два простеньких уровня из другого популярного платформера и реализуешь их."
    "Эту ночь ты практически не спишь... До четырёх часов ночи ты работаешь как никогда раньше, и у тебя..."
    "...Получилось! Ты сделал это! Спрайты для игры готовы, механики тоже. Ты засыпаешь прямо на столе перед ноутбуком."
    jump end_day_3

label blue_scene_3:
    maincharacter "Я работаю над платформером, но некоторые вещи всё еще не успел реализовать."
    maincharacter "Если честно, мне бы очень пригодилась помощь с финальными доработками — багами и оптимизацией."

    "Ты даёшь ему сыграть в твой прототип игры."
    
    pavel "Хм, ну, выглядит неплохо, давай проверим механики..."
    pavel "..."
    pavel "Ага! Если слишком часто нажимать кнопку стрельбы, то возможность стрелять ломается. Сейчас исправим!"

    "Он молниеносно находит эту механику в коде и исправляет её, а ты даже не успеваешь уследить за его действиями"
    jump big_scene_4

label blue_scene_END_IS_NEAR:
    show boss hands_:
        xalign 0.3
        yalign 1.05
    boss "Итак, [gg_name]. Я ждал вас."
    boss "Не будем тянуть. Начнём."

    "Твоя ладонь крепче сжимает флешку, и ты быстро подходишь к компьютеру, подключаешь её к порту." 
    "Ты включаешь игру, и на экране появляется главное меню — результат дней и ночей работы, испытание для твоих навыков и терпения."
    "Открывается первый уровень, и ты слышишь..."

    boss "Прошу, сначала расскажите про вашу игру. Что она из себя представляет?"

    maincharacter "Пиксельный платформер в жанре фэнтези, сделанный на движке Unreal Engine."
    maincharacter "Персонаж умеет делать двойной прыжок и стрелять энергетическими шарами во врагов."
    maincharacter "Есть три разнообразных уровня, в которых есть секретные комнатки с бонусами."

    boss "Пиксельный платформер? На Unreal Engine? Хм, посмотрим..."
    boss "Что делает твою игру особенной?"

    maincharacter "Ну... Уникальный стиль, наверное..."

    boss "Уникальный стиль, говоришь?"
    boss "А по мне ты весь дизайн спёр из первого попавшегося сайта с готовыми ассетами."

    "Напряжение в комнате нарастает, ты понял, что совершил ошибку, ты начинаешь краснеть и стесняться. Как будто стены начинают на тебя давить."

    maincharacter "Да, но... Я-я..."
    maincharacter "Я сделал так, чтобы этот дизайн органично смотрелся в моём платформере, чтобы все эти механики и этот стиль дополняли друг друга."

    "Босс что-то записывает себе в блокнот. Кажется, он совсем не впечатлён."

    boss "Хорошо, продолжим. Покажи, как ты проходишь этот уровень."
    
    "Ты демонстрируешь управление, двойной прыжок, стрельбу, трёх врагов, секретную комнату в уровне."
    "Ты прошёл уровень."

    boss "Что этот уровень из себя представляет? Что он показывает игроку?"

    maincharacter "Он показывает все механики в игре, демонстрирует, как вообще работает игра."

    boss "Все возможности механик предоставлены в самом же первом уровне?"

    "Он опять записывает что-то в блокнот, и теперь он явно чем-то недоволен."

    boss "Уровни должны идти по нарастающей, механики должны открываться постепенно, чтобы игрок мог быстро адаптироваться и всегда получал какую-то новую информацию, чтобы было интереснее играть."
    boss "С этим разобрались, а теперь..."
    boss "Позволь мне пройти следующие уровни."

    maincharacter "Да, конечно... прошу."

    "Ты передаешь клавиатуру и мышь Боссу"
    "Он не спеша проходит второй уровень, прыгая в различные стороны и задевая все стены."
    "Вдруг персонаж игры вылетает за пределы уровня." 
    "Перезапуск." 
    "Босс не реагирует, перепроходит уровень." 
    "В третьем уровне он пытается умереть от лёгких врагов, но безуспешно. Кажется, главный герой не получает от них урона."
    "Снова никакой реакции." 
    "Босс находит секретную комнату и проходит уровень. Никакой реакции." 
    "Игра пройдена."

    boss "Мгм."
    "Он снова записывает что-то в блокнот"
    boss "Баги. Расскажи, как ты с ними справлялся?"

    maincharacter "Когда я сделал первую версию игры, у меня было довольно много багов, таких как неработающая стрельба, сломанная физика."
    maincharacter "Критические баги мне помог пофиксить ваш сотрудник, Павел."
    maincharacter "Некоторую часть я исправил после встречи с ним, после того, как я научился правильно находить и фиксить баги."
    maincharacter "Часть багов также отпала, когда я делал рефакторинг кода. На исправление оставшихся багов просто не хватило времени..."

    boss "Оу, так ты уже и с сотрудниками познакомился? И даже поработать с ними успел? Это, несомненно, большой плюс."

    maincharacter "Да, ваши сотрудники довольно отзывчивы, и не только Павел. Они мне помогли в разработке игры."

    boss "Да, именно таких мы и берём в нашу команду."
    boss "А теперь скажи-ка мне честно, мы дали тебе на разработку игры полгода..."
    boss "Сколько из этого времени вы потратили на свою игру, что тебе не хватило времени, чтобы исправить баги?"
    menu:
        "4 Дня. (сказать правду)":
            jump blue_end
        "Ну... где-то месяц (солгать)":
            jump blue_scene_END_IS_NEAR



label blue_end:

    maincharacter "Я начал разработку 4 дня назад, когда пришло ваше письмо... "
    maincharacter "Я так увлёкся видеоиграми и развлечениями, что забыл о дедлайне..."

    boss "То есть ты хочешь сказать, что ты создал ЭТУ игру за 4 дня?!"
    boss "Платформер на UNREAL ENGINE?"
    boss "С реализованными механиками!?"

    maincharacter "Ну... Получается так. Извините, что забыл о дедлайне, это было глупо с моей стороны."

    boss "Да, это действительно было бы глупо! Если ты умудрился сделать неплохую игру за 4 дня, то представь, что ты сделал бы за месяц!"

    "Он проверяет дату изменения файлов и убеждается, что ты говоришь правду"

    boss "Это просто невероятно, [gg_name]!"
    boss "Теперь я вовсе не виню тебя за то, что ты взял готовые спрайты из интернета, это было лучшее решение, чтобы больше времени потратить на разработку."
    boss "Правда, делать 2D-платформер на Unreal Engine - это немного странная идея, потому что движок больше специализируется на 3D-играх."
    boss "Но несмотря на это, у тебя получился играбельный 2D-платформер. Я удивлён."
    boss "Что касается багов..."
    boss "Это совершенно нормально!"
    boss "Всего 4 дня разработки, полного отсутствия багов невозможно добиться в такой короткий срок, это полностью оправдано."
    boss "Уверен, будь у тебя больше времени, ты бы несомненно справился, ведь так?"

    maincharacter "Так точно, сэр!"
    boss "Я и не сомневался."

    "Его лицо приобретает радостный вид, на его лице появляется улыбка."

    boss "Я готов сделать вердикт."

    maincharacter "Правда? Вот так сразу?"

    boss "Конечно, зачем тянуть?"

    maincharacter "Я вас слушаю..."

    "Твоё сердце начинает биться сильнее и сильнее, как будто оно сейчас вырвется из твоей груди и побежит делать платформер, где нужно прыгать, когда стучит сердце. Прыгать придётся очень часто."

    boss "Учитывая, что вы безответственно отнеслись к дедлайну, и потратили всего четыре дня из шести месяцев..."
    boss "При этом сделав хорошую игру в такой короткий срок..."
    boss "Также учитывая ваше странное решение сделать игру на Unreal Engine, что означает, что вы не знаете о том, какие движки лучше использовать в различных ситуациях..."
    boss "Я принимаю решение..."
    boss "Принять вас на испытательный срок - 1 месяц."
    boss "В случае успешной работы в течение этого месяца вы станете полноценным разработчиком в нашей компании."
    boss "Ну, [gg_name], что скажете?"

    maincharacter "Да! Да, чёрт возьми!"
    maincharacter "Попасть к вам - вот моя мечта. И она сбывается. Спасибо вам, я вас не подведу!"

    boss "Добро пожаловать в команду!"

    jump epilog_blue

label epilog_blue:
    scene bg yay with fade

    "И вот ты официально стал частью команды, и теперь ты работаешь вместе с теми, кто тебе помогал и продолжает помогать до сих пор."
    "Сева, Павел, Настя, Костян - все рады видеть тебя в дружном коллективе."
    "Вам сразу был назначен проект - соревновательная 2D-игра для четырёх игроков с элементами платформера. Ты легко реализуешь все те механики, которые вы вместе продумали."
    "Вы обсуждаете код, исправляете баги, придумываете что-то новое, проектируете."
    "Ты явно добиваешься успеха в этой команде, поэтому Босс устраивает тебя полноценным разработчиком спустя 15 дней после начала испытательного срока."
    "Твоя мечта сбылась - ты наконец становишься разработчиком видеоигр в одной из лучших компаний."
    "И вот так заканчивается, или же только начинается история одного амбициозного разработчика видеоигр..."
    jump credits

