label street:
    scene bg ggroom_bright with fade
    show gg_sprite

    maincharacter "Коворкинг. Место, куда люди приходят, чтобы вместе или в одиночку поработать над чем-то."
    "Ты выходишь из дома и направляешься в офисный коворкинг компании, в которую трудоустраиваешься."

    scene bg street_test with fade
    show gg_sprite
    with moveinright

    "Среди всех прохожих ты замечаешь коллегу, который присутствовал на твоём собеседовании на работу."
    "Он всем своим видом кричит, что он - программист и любитель видеоигр:"
    'толстовка с надписью "Atomic Heart", браслеты с названиями старых пиксельных видеоигр, рюкзак со множеством тематических наклеек, очки, джинсы и... очень растряпанная причёска.'
    menu:
        "Поговорить с ним":
            jump talking_on_the_street
        "Пройти мимо":
            # jump
            return 
    return