label talking_on_the_street:
    scene bg street_test with fade
    show gg_sprite at right
    with moveinright
    show seva_sprite at left
    with moveinleft
    menu:
        'Что ты собираешься ему сказать?'
        "Классный прикид!":
            seva "Спасибо!"
            "Отблагодарив за комплимент, он просто пошёл дальше по своим делам."
            menu:
                "Привлечь его внимание, попытаться остановить.":
                    maincharacter "Эй! Помнишь меня? Я был на собеседовании.\nМне дали задание, игра, которую я... давно должен был начать делать."

                    seva "Что-то плохо помню, давно это было, да и задание такое мы дали довольно многим."
                    seva "А что? Ты что-то хотел?"

                    maincharacter "Да, мне нужна помощь. Можешь на пару вопрос ответить как опытный разработчик?"

                    seva "Я немного спешу, поэтому могу ответить только на один. Меня, кстати Сева звать."

                    maincharacter "Подскажи, какой язык лучше всего использовать для быстрой разработки игры?"

                    seva "C#. Это база. Такое знать надо. В основном на нём игры пишут, и ещё на C# множество современных игр написано. А также он используется в игровом движке Unity."
                    seva "Во-первых, язык довольно производительный, во-вторых, огромное коммьюнити и куча библиотек и фреймворков."
                    seva "В-третьих, язык не слишком сложный для изучения и имеется колоссальное количество материалов, гайдов, видео для изучения. Ну что, подходящий ответ?"
                    
                    maincharacter "Ого. Да, это действительно хороший ответ. Я как раз этот язык и изучал. Не уверен был, точно ли мне стоит его использовать, спасибо что прояснил."

                    seva "Не за что, ну давай, мне пора, удачи в реализации игры!"

                    "Сева уходит, а ты направляешься в коворкинг"
                    
                    jump pass_scene

                "Пусть уходит. Не буду мешать.":
                    "Ты продолжаешь идти в сторону коворкинг"
                    jump pass_scene
                    return
            return
        "Привет! Не против, если задам пару вопросов?":
            return
        "П-п-привет...":
            return