label violet_scene_1:
    "Поиск{cps=2}...{/cps}"
    "Отлично! Пару десятков минут поиска в открытых источниках и подходящие спрайты есть!"
    "Все рисунки выполнены в жанре постапокалипсиса, где всё грязное, заброшенное, в тёмных тонах. Как раз то, что нужно."
    "Теперь нужно подключить все эти текстурки в игру, используя инструмент в движке {bt=6}{color=#1cd3a2}Tilemap{/color}{/bt}, привязать к объекту персонажа, к другим объектам."
    "Подключение текстур{cps=2}...{/cps}"
    "Всё это делается довольно быстро, и вот ты уже закончил со спрайтами. Ты уже хотел было отдохнуть, но тут..."
    jump big_scene_2

label violet_scene_2:
    maincharacter "Без паники! у меня уже почти всё готово! Нужны лишь уровни... Не будет мне никакого отдыха в эти 2 дня! За работу!!"
    "Ты начинаешь придумывать уровни, без сюжета, ведь на это просто нет времени."
    "За этот день ты спланировал всего 5 остроумных уровней, которые используют все механики, осталось только их реализовать."
    "Эту ночь ты практически не спишь... До четырёх часов ночи ты программируешь и попутно исправляешь придуманные в спешке уровни, и у тебя..."
    "...Получилось! Ты сделал это! Ты засыпаешь прямо на столе перед ноутбуком."
    jump end_day_3

label violet_end:

    maincharacter "Ну... На разработку ушло где-то месяц, вроде."
    
    boss "Ты целый месяц разрабатывал эту игру, и ты не удосужился пофиксить самый очевидный баг? Я про тот, где игрок не получает урона от врагов."

    maincharacter "Но я..."

    boss "Что ты? Тебе нужно было больше времени?"
    boss "У тебя было полгода! Нужно было уделять больше времени для своей игры!"
    boss "Ты еще и ассеты из интернета взял..."
    boss "Так ты ещё и некоторые баги не исправил!"

    "Ты очень сильно облажался, когда соврал про время разработки." 
    "Теперь он зол, и перечисляет все недостатки твоей игры. Тебе так стыдно, что ты уже просто не можешь сказать правду, потому что Босс уже не поверит."

    boss "Но в целом... Платформер очень даже достойный. Интересная задумка с разными мирами и геймплей я бы даже сказал хороший."
    boss "И да, дизайн игры, украденный тобой из интернета, действительно смотрится органично с твоим геймплеем."
    boss "Слушай, [gg_name], я вижу в тебе потенциал, просто..."
    boss "Это задание было дано, чтобы проверить тебя, и я узнал о тебе всё, что нужно."
    boss "Я готов сделать вердикт."

    maincharacter "Правда? Вот так сразу?"

    boss "Конечно, зачем тянуть?"

    maincharacter "Я вас слушаю..."

    "Твоё сердце начинает биться сильнее и сильнее, как будто оно сейчас вырвется из твоей груди и побежит делать платформер, где нужно прыгать, когда стучит сердце. Прыгать придётся очень часто."

    boss "Учитывая, что вы безответственно отнеслись к дедлайну, и потратили всего месяц, при этом сделав финальный продукт, не протестировав его..."
    boss "Также учитывая, что задумка игры вполне неплохая, и сам по себе платформер хороший."
    boss "В общем..."
    boss "Я вижу вы очень способны, поэтому я готов принять вас на испытательный срок в 1 месяц, а дальше уже посмотрим, брать вас или нет."
    boss "Ну, [gg_name], что скажете?"

    maincharacter "Да! Да, чёрт возьми!"
    maincharacter "Попасть к вам - вот моя мечта. И она сбывается. Спасибо вам, я вас не подведу!"

    boss "Добро пожаловать в команду!"
    jump violet_epilog

label violet_epilog:
    scene bg yay with fade
    "И вот ты официально стал частью команды, и теперь ты работаешь вместе с теми, кто тебе помогал и продолжает помогать до сих пор."
    "Сева, Павел, Настя, Костян - все рады видеть тебя в дружном коллективе."
    "Вам сразу был назначен проект - соревновательная 2D-игра для четырёх игроков с элементами платформера."
    "Ты легко реализуешь все те механики, которые вы вместе продумали. Вы обсуждаете код, исправляете баги, придумываете что-то новое, проектируете."
    "Ты явно добиваешься успеха в этой команде, поэтому Босс устраивает тебя полноценным разработчиком спустя 15 дней после начала испытательного срока."
    "Твоя мечта сбылась - ты наконец становишься разработчиком видеоигр в одной из лучших компаний"
    "И вот так заканчивается, или же только начинается история одного амбициозного разработчика видеоигр..."
    jump credits